[
    {
      "skillName" : "Java",
      "color" : "#FF9B00",
      "bar" : 70,
      "details" : "Java를 메인 언어로 사용하고 있습니다. 클래스와 인터페이스를 활용하여 객체지향적으로 코드를 작성하려고 노력하고 있습니다. 백엔드 개발을 하면서 성능을 개선하고 기능을 원활하게 구현하기 위해 알고리즘과 자료구조에 대해 공부하고 있습니다. 최근에는 멀티스레딩에 대해 학습 중이며, 스레드를 활용한 방법을 공부 중입니다."
    },
    {
      "skillName" : "Spring",
      "color" : "#8AE634",
      "bar" : 60,
      "details" : "Spring 프레임워크를 사용하여 서버 및 웹 서비스를 개발한 경험이 있습니다. Spring의 다양한 기능들을 습득하며, REST API를 구현하여 프론트엔드와 데이터를 주고받을 수 있도록 하였습니다. 또한, API의 사용 방법을 더욱 쉽게하기 위해 Swagger를 활용하여 API 문서를 자동으로 생성하고 관리하였습니다."
    },
    {
      "skillName" : "JavaScript",
      "color" : "#FFC519",
      "bar" : 60,
      "details" : "기본적인 문법을 활용하여 사용자가 원하는 이벤트를 구현할 수 있습니다. 최근에는 페이지의 성능을 개선하기 위해 IntersectionObserver를 학습하고 활용하는 방법을 익혔습니다. 이를 통해 페이지의 스크롤 이벤트를 효율적으로 처리하고 사용자 경험을 향상시킬 수 있습니다."
    },
    {
      "skillName" : "React",
      "color" : "#00D7FF",
      "bar" : 50,
      "details" : "사용자 경험을 향상시키기 위해 React를 활용한 동적인 UI 개발에 참여했습니다. 이 과정에서 JSX 문법과 React 훅을 통해 효율적인 이벤트 처리와 컴포넌트 재사용성을 경험했으며, 이를 통해 프론트엔드와 백엔드 간의 원활한 통합을 위해서 API문서의 작성이 중요하다는 것을 알게 되었습니다."
    },
    {
      "skillName" : "Python",
      "color" : "#1E96FF",
      "bar" : 40,
      "details" : "데이터 처리를 위해 Python을 공부하였습니다. pandas와 numpy 라이브러리를 활용하여 데이터 전처리를 수행하고, matplotlib와 seaborn을 사용하여 데이터를 시각화할 수 있습니다."
    },
    {
      "skillName" : "Tenserflow",
      "color" : "#FFB900",
      "bar" : 40,
      "details" : "딥러닝에 대해 공부하였습니다. 이미지 분석 및 생성 모델들을 공부하였고 특히 생성형 모델인 GAN에 관심이 있어 활용하였습니다."
    },
    {
      "skillName" : "HTML",
      "color" : "#FF4419",
      "bar" : 70,
      "details" : "HTML을 통해 웹 페이지의 기본 구조를 구축하는 방법을 학습했습니다. 다양한 태그를 활용하여 웹 페이지의 기본 레이아웃을 쉽게 구성할 수 있습니다"
    },
    {
      "skillName" : "CSS",
      "color" : "#90AFFF",
      "bar" : 70,
      "details" : "CSS를 통해 웹 페이지의 스타일을 디자인하는 방법을 학습하였습니다. 부트스트랩 없이도 원하는 디자인을 구현할 수 있는 능력을 갖추고 있습니다."
    },
    {
      "skillName" : "Git",
      "color" : "#FF6947",
      "bar" : 50,
      "details" : "팀 프로젝트의 소스 코드를 Git을 통해 관리하고, 이를 통해 Git의 기본 기능과 브랜치 관리 및 충돌 해결에 대한 경험을 쌓았습니다. 또한, 협업을 위해 Git 전략 중 하나인 Git Flow에 대한 학습 계획을 세우고 있습니다."
    },
    {
      "skillName" : "AWS",
      "color" : "#FF8A19",
      "bar" : 40,
      "details" : "프로젝트에서 이미지 데이터의 효율적인 관리를 위해 AWS S3를 활용하여 데이터를 저장하고 관리했습니다. 더불어, AWS RDS를 이용하여 로컬 환경이 아닌 클라우드 환경에서 데이터베이스를 관리함으로써 효과적인 협업을 진행할 수 있었습니다."
    }

  ]